library(tidyverse)

# Set up default Likert labels
likert.agree.labels <- c("Strongly disagree (1)",
                         "(2)",
                         "(3)",
                         "(4)",
                         "(5)",
                         "(6)",
                         "Strongly agree (7)")
likert.important.labels <- c("Least important (1)",
                             "(2)",
                             "(3)",
                             "(4)",
                             "(5)",
                             "(6)",
                             "Most important (7)")
likert.comfortable.labels <- c()
likert.closely.labels <- c()

privacy.original <- read.csv("Original data/results.csv")
































# Make the column names more interpretable
privacy <- privacy.original %>% 
  as_tibble() %>% 
  rename(location = V3...第1题.单选题..下列哪项最能贴切地描述你的住所...1.农村.乡野...2.小城市...3.中等规模的城市...4.大城市..) %>% 
  rename(province = V4...第2题.下拉单选题..你住在哪个省....1.北京市...2.天津市...3.河北省...4.山西省...5.内蒙古自治区...6.辽宁省...7.吉林省...8.黑龙江省...9.上海市...10.江苏省...11.浙江省...12.安徽省...13.福建省...14.江西省...15.山东省...16.河南省...17.湖北省...18.湖南省...19.广东省...20.广西壮族自治区...21.海南省...22.重庆市...23.四川省...24.贵州省...25.云南省...26.西藏自治区...27.陕西省...28.甘肃省...29.青海省...30.宁夏回族自治区...31.新疆维吾尔自治区...32.其他..) %>% 
  rename(city = V5...第3题.填空题..你住在哪个城市...) %>% 
  rename(age = V7...第5题.填空题..你的年龄.________岁..) %>% 
  rename(education = V8...第6题.单选题..你已获得的最高学历是什么.....1.没有正规教育...2.小学...3.初中...4.高中...5.大学...6.研究生及以上..) %>% 
  rename(sex = V9...第7题.单选题..你的性别...1.女...2.男..) %>% 
  rename(marriage.status = V10...第8题.单选题..你的婚姻状况...1.未婚...2.在一段男女朋友关系中...3.已婚...4.离婚..) %>% 
  rename(job.type = V11...第9题.单选题..下列哪项最能描述你的工作类型....1.白领...2.工人...3.个体经营者...4.农业生产者...5.失业...6.退休...7.学生.. ) %>% 
  rename(job.company.type = V12...第10题.单选题..下列哪项最能描述你所工作的公司或单位类型....1.国有企业...2.政府.地方或中央....3.事业单位员工...4.国内私营企业...5.在中国经营的国际私营企业...6.个体经营的小型企业...7.农业.. ) %>% 
  rename(party.member.status = V13...第11题.单选题..你是党员或者预备党员吗....1.是...2.不是..) %>% 
  rename(cyl.status = V14...第12题.单选题..你是共青团成员吗....1.是...2.不是..) %>% 
  rename(income = V15...第13题.单选题..哪项最能代表你家每月的总收入.税后.单位.元.....1.0...2.999...2.3.000...5.999...3.6.000...9.999...4.10.000...19.999...5.20.000...49.999...6.50.000...99.999...7.100.000以上..) %>% 
  rename(hukou.status = V16...第14题.单选题..你的户口和居住状况是什么.....1.住在城市.拥有城市户口...2.住在城市.拥有农村户口...3.住在农村.拥有农村户口...4.住在农村.拥有城市户口...5.海外华人..包括香港和澳门....6.其他.请注明...) %>%
  rename(hukou.status.other = 自填内容) %>% 
  rename(k1 = V18...第15题.单选题..您对自己的网络隐私情况担心程度如何....1.1.完全不担心...2.2...3.3...4.4...5.5...6.6...7.7.非常担心..) %>% 
  rename(k2 = V19...第16题.填空题..当听到网络隐私这个词的时候.你认为哪些类型的个人信息与网络隐私有关.请列出几种类型的信息...自由回答.开放式回答...) %>% 
  rename(k3 = V20...第17题.填空题..请列举一些你对你的网络隐私感到担忧的情况.以及你认为你的隐私未能得到保护的后果.例如.在网上进行支付..担心罪犯会偷走我的支付信息...自由回答.开放式回答.注意不要照抄样例...) %>% 
  rename(k4 = V21...第18题.单选题..我花很多时间阅读科技引发的隐私问题...1.1.非常同意...2.2...3.3...4.4...5.5...6.6...7.7.强烈反对..) %>%
  rename(k5 = V22...第19题.单选题..在过去的一年中.我和我的朋友们讨论过有关网络隐私安全的话题...1.1.非常同意...2.2...3.3...4.4...5.5...6.6...7.7.强烈反对.. ) %>% 
  rename(k6 = V23...第20题.数字量表题..我知道我在网上能拥有多少隐私...1.1.非常同意...2.2...3.3...4.4...5.5...6.6...7.7.强烈反对..) %>% 
  rename(k7 = V24...第21题.单选题..你听说过社会信用体系这个术语吗..官方术语.....1.是的.了解关于这个体系的具体细节...2.是的.听说过一些关于这个体系的基本信息但不是具体细节...3.是的.但只是听说过这个术语.并不了解任何相关信息...4.从没听过..) %>% 
  rename(k8 = V25...第22题.填空题..基于你对社会信用体系的了解.请列举出一些你认为会降低你社会信用评分的行为.______.自由回答.开放式回答...) %>% 
  rename(k9 = V26...第23题.填空题..根据你对社会信用体系的了解.请列举出一些你认为社会信用评分较低时会受到限制或被禁止的行为.自由回答.开放式回答...) %>% 
  rename(p.pd1 = V27...第24题.数字量表题..当我选择一个理想的职业时.我认为与上司拥有良好的工作关系是很重要的....1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>%
  rename(p.pd2 = V28...第25题.数字量表题..当我与我的上司有分歧时.我认为能够充分表达这些分歧是很重要的....1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(p.ic1 = V29...第26题.数字量表题..当我选择一个理想的职业时.我认为能够拥有充足的时间用于个人或家庭生活是很重要的....1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意.. ) %>% 
  rename(p.ic2 = V30...第27题.数字量表题..有一个充满多样性和冒险的工作比有一个稳定和安全的工作更重要....1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(p.mf1 = V31...第28题.数字量表题..大多数人都是可以信任的....1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(p.mf2 = V32...第29题.数字量表题..当人们在生活中失败的时候.这往往是他们自己的错误....1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(p.ua1 = V33...第30题.数字量表题..我更喜欢我的上司在工作中给我严格的工作指令....1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(p.ua2 = V34...第31题.数字量表题..职员之间的竞争通常弊大于利....1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(p.lo1 = V35...第32题.数字量表题..在你的私人生活中.节俭有多么重要....1.1.非常不重要...2.2...3.3...4.4...5.5...6.6...7.7.非常重要..) %>% 
  rename(p.lo2 = V36...第33题.数字量表题..在你的私人生活中.尊重传统有多么重要....1.1.非常不重要...2.2...3.3...4.4...5.5...6.6...7.7.非常重要..) %>% 
  rename(gp1 = V37...第34题.数字量表题..总的来说.我对中央政府的表现感到满意...1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(gp2 = V38...第35题.数字量表题..总的来说.我对我的居住地的地方政府的表现感到满意...1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(gp3 = V39...第36题.数字量表题..在监控的使用方面.政府很好地平衡了公民拥有的不受监控的权利.与政府维护秩序预防犯罪的需要...1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(ma1 = V40...第37题.单选题..你多久阅读一次新闻....1.每天很多次...2.每天几次...3.一天一次...4.平均每天少于一次...5.我不看新闻..) %>% 
  rename(ma2 = V41...第38题.单选题..你的主要新闻来源是什么....1.报纸...2.微信...3.门户网站..指通向某类综合性互联网信息资源并提供有关信息服务的应用系统.最著名的门户网站有中国四大门户网站.新浪.网易.搜狐.腾讯....4.电视...5.微博...6.境外渠道..新闻媒体.互联网网站.互联网社交平台.面对面交流....7.其他.请举例说明...) %>%
  rename(ma2.other = 自填内容.1) %>% 
  rename(gm1 = V43...第39题.矩阵单选题..对于政府监控问题.选择你认为最合适的程度选项..中央政府监控用户的网上活动是有充分理由的.....1.强烈反对..2.比较反对..3.稍微反对..4.中立..5.稍微同意..6.比较同意..7.强烈同意...) %>% 
  rename(gm2 = V44...第39题.矩阵单选题..对于政府监控问题.选择你认为最合适的程度选项..地方政府监控用户的网上活动是有充分理由的.....1.强烈反对..2.比较反对..3.稍微反对..4.中立..5.稍微同意..6.比较同意..7.强烈同意...) %>% 
  rename(gm3 = V45...第39题.矩阵单选题..对于政府监控问题.选择你认为最合适的程度选项..私人公司监控用户的网上活动是有充分理由的.....1.强烈反对..2.比较反对..3.稍微反对..4.中立..5.稍微同意..6.比较同意..7.强烈同意...) %>% 
  rename(gm4 = V46...第39题.矩阵单选题..对于政府监控问题.选择你认为最合适的程度选项..我可以接受向政府提供我的生物信息.包括我的指纹.面部细节用于公共区域的监控目的.....1.强烈反对..2.比较反对..3.稍微反对..4.中立..5.稍微同意..6.比较同意..7.强烈同意...) %>% 
  rename(gm5 = V47...第39题.矩阵单选题..对于政府监控问题.选择你认为最合适的程度选项..我可以接受向私人公司提供我的生物信息.包括我的指纹.面部细节用于公共区域的监控目的.....1.强烈反对..2.比较反对..3.稍微反对..4.中立..5.稍微同意..6.比较同意..7.强烈同意...) %>% 
  rename(misc1 = V48...第40题.矩阵单选题..对于以下问题.选择你认为最合适的程度选项..总的来说.社会信用体系对公众是有益的....1.强烈反对..2.比较反对..3.稍微反对..4.中立..5.稍微同意..6.比较同意..7.强烈同意...) %>% 
  rename(misc2 = V49...第40题.矩阵单选题..对于以下问题.选择你认为最合适的程度选项..由于担心自己的社会信用评分.我在去年有意识地改变了自己的行为....1.强烈反对..2.比较反对..3.稍微反对..4.中立..5.稍微同意..6.比较同意..7.强烈同意...) %>% 
  rename(misc3 = V50...第40题.矩阵单选题..对于以下问题.选择你认为最合适的程度选项..我没有注意到政府在日常生活中有运用科技来监控我的行为....1.强烈反对..2.比较反对..3.稍微反对..4.中立..5.稍微同意..6.比较同意..7.强烈同意...) %>% 
  rename(misc4 = V51...第40题.矩阵单选题..对于以下问题.选择你认为最合适的程度选项..我认为政府会比私有企业更安全更好地储存我在网上的个人信息和数据....1.强烈反对..2.比较反对..3.稍微反对..4.中立..5.稍微同意..6.比较同意..7.强烈同意...) %>% 
  rename(misc5 = V52...第40题.矩阵单选题..对于以下问题.选择你认为最合适的程度选项..我不介意私有企业把我的数据卖给第三方公司.如果此私有企业能让我免费使用他们的应用程序....1.强烈反对..2.比较反对..3.稍微反对..4.中立..5.稍微同意..6.比较同意..7.强烈同意...) %>% 
  rename(misc6 = V53...第40题.矩阵单选题..对于以下问题.选择你认为最合适的程度选项..我担心我的支付信息可能会被盗或者泄露....1.强烈反对..2.比较反对..3.稍微反对..4.中立..5.稍微同意..6.比较同意..7.强烈同意...) %>% 
  rename(ts1 = V54...第41题.数字量表题..你如何综合评价你的电脑使用能力....1.1.非常不熟练或非常不了解...2.2...3.3...4.4...5.5...6.6...7.7..非常熟练或非常了解..) %>%
  rename(ts2 = V55...第42题.数字量表题..你如何评价你维护电脑软件系统的能力....1.1.非常不熟练或非常不了解...2.2...3.3...4.4...5.5...6.6...7.7..非常熟练或非常了解..) %>% 
  rename(ts3 = V56...第43题.数字量表题..你如何评价你的编程能力....1.1.非常不熟练或非常不了解...2.2...3.3...4.4...5.5...6.6...7.7..非常熟练或非常了解..) %>% 
  rename(ts4 = V57...第44题.单选题..你认为人脸识别技术的使用范围有多广....1.非常广泛.在大多数公共场所使用....2.广泛.应用于主要公共场所....3.适度.局部部署....4.有限地使用.只在少数地方使用....5.不使用.仅作为试验或根本不使用...) %>% 
  rename(track1 = V58...第45题.数字量表题..你认为中央政府在多么密切地追踪你的网上活动....1.1..非常不密切...2.2...3.3...4.4...5.5...6.6...7.7..非常密切..) %>% 
  rename(track2 = V59...第46题.数字量表题..你认为地方政府在多么密切地追踪你的网上活动....1.1.非常不密切...2.2...3.3...4.4...5.5...6.6...7.7..非常密切..) %>% 
  rename(track3 = V60...第47题.数字量表题..你认为私人公司在多么密切地追踪你的网上活动....1.1.非常不密切...2.2...3.3...4.4...5.5...6.6...7.7..非常密切..) %>% 
  rename(track4 = V61...第48题.数字量表题..你有多介意中央政府了解你个人网上活动的细节....1.1..非常介意...2.2...3.3...4.4...5.5...6.6...7.7..非常不介意..) %>% 
  rename(track5 = V62...第49题.数字量表题..你有多介意地方政府了解你个人网上活动的细节....1.1.非常介意...2.2...3.3...4.4...5.5...6.6...7.7..非常不介意..) %>% 
  rename(track6 = V63...第50题.数字量表题..你有多介意私人公司了解你个人网上活动的细节....1.1..非常介意...2.2...3.3...4.4...5.5...6.6...7.7.非常不介意..) %>%
  rename(exp.group = 实验1...1.基准组...2.实验组..) %>%   
  rename(etr1 = V66...第53题.数字量表题..我不认为社会信用体系会牵涉很严重的隐私问题....1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>%
  rename(etr2 = V67...第54题.数字量表题..我不认为社会信用体系会对自己造成很大的影响....1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(etr3 = V68...第55题.数字量表题..我不是很担心我的私人信息会被共享在网络上...1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(etr4 = V69...第56题.数字量表题..总体来说.我认为公司不会滥用我的私人信息...1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>% 
  rename(etr5 = V70...第57题.数字量表题..总体来说.我认为政府不会滥用我的私人信息....1.1.强烈反对...2.2...3.3...4.4...5.5...6.6...7.7.强烈同意..) %>%
  rename(etr6.mc.1 = V71...第58题.多选题..根据新闻中的信息.请指出哪些日常生活领域可能会受到社会信用评分的影响.选择所有你认为适用的项....1.购买火车票..) %>% 
  rename(etr6.mc.2 = V72...第58题.多选题..根据新闻中的信息.请指出哪些日常生活领域可能会受到社会信用评分的影响.选择所有你认为适用的项....2.采购日常用品..) %>% 
  rename(etr6.mc.3 = V73...第58题.多选题..根据新闻中的信息.请指出哪些日常生活领域可能会受到社会信用评分的影响.选择所有你认为适用的项....3.限制你对互联网的使用..) %>% 
  rename(etr6.mc.4 = V74...第58题.多选题..根据新闻中的信息.请指出哪些日常生活领域可能会受到社会信用评分的影响.选择所有你认为适用的项....4.购买机票..) %>%
  rename(etr6.mc.5 = V75...第58题.多选题..根据新闻中的信息.请指出哪些日常生活领域可能会受到社会信用评分的影响.选择所有你认为适用的项....5.禁止购买酒类..) %>% 
  rename(le.group = 实验2...1.版本1...2.版本2...3.版本3..) %>% 
  rename(le.5th.shown = If.the.5th.option.was.shown.0..not.shown.1..shown) %>% 
  rename(le.num = V77...第60题.填空题..以上列表中.有多少个您信赖并愿意托付个人信息的实体...请填数字.注意是要填.多少个..而不是写具体哪一个...) %>%
  select(- c(序号1, 序号2, 答卷者)) %>% 
  select(- V65...第52题.单选题..您是否已认真读完上述材料....1.我已认真读完.可以继续回答后续题目..)

# Recode demographic variables
privacy <- privacy %>% 
  mutate(location = factor(location, 
                           levels=c(1, 2, 3, 4),
                           labels=c("Countryside/village",
                                    "Small city",
                                    "Mid-sized city",
                                    "Big city"))) %>% 
  mutate(province = factor(province,
                           levels=c(1:32),
                           labels=c("Beijing",
                                    "Tianjin",
                                    "Hebei",
                                    "Shanxi",
                                    "Inner Mongolia",
                                    "Liaoning",
                                    "Jilin",
                                    "Heilongjiang",
                                    "Shanghai",
                                    "Jiangsu",
                                    "Zhejiang",
                                    "Anhui",
                                    "Fujian",
                                    "Jiangxi",
                                    "Shandong",
                                    "Henan",
                                    "Hubei",
                                    "Hunan",
                                    "Guangdong",
                                    "Guangxi",
                                    "Hainan",
                                    "Chongqing",
                                    "Sichuan",
                                    "Guizhou",
                                    "Yunnan",
                                    "Tibet",
                                    "Shaanxi",
                                    "Gansu",
                                    "Qinghai",
                                    "Ningxia",
                                    "Xinjiang",
                                    "Other"))) %>%
  mutate(education = factor(education,
                            levels=c(1:6),
                            labels=c("No formal education",
                                     "Primary",
                                     "Middle school",
                                     "High school",
                                     "University",
                                     "Advanced studies/Graduate school"))) %>% 
  mutate(sex = factor(sex,
                      levels=c(1:2),
                      labels=c("Female",
                               "Male"))) %>% 
  mutate(marriage.status = factor(marriage.status,
                                  levels=c(1:4),
                                  labels=c("Single",
                                           "In a relationship",
                                           "Married",
                                           "Divorced"))) %>% 
  mutate(job.type = factor(job.type,
                           levels=c(1:7),
                           labels=c("White collar worker",
                                    "Laborer",
                                    "Self-employed",
                                    "Agricultural worker",
                                    "Unemployed",
                                    "Retired",
                                    "Student"))) %>% 
  mutate(job.company.type = factor(job.company.type,
                                   levels=c(1:7),
                                   labels=c("State owned enterprise",
                                            "Government (local or central)",
                                            "Public institution employee",
                                            "Domestic private enterprise",
                                            "International private enterprise operating in China",
                                            "Self-employed small enterprise",
                                            "Agriculture"))) %>% 
  mutate(party.member.status = factor(party.member.status,
                                      levels=c(1:2),
                                      labels=c("Yes",
                                               "No"))) %>% 
  mutate(cyl.status = factor(cyl.status,
                             levels=c(1:2),
                             labels=c("Yes",
                                      "No"))) %>% 
  mutate(income = factor(income,
                         levels=c(1:7),
                         labels=c("0-2,999",
                                  "3,000-5,999",
                                  "6,000-9,999",
                                  "10,000-19,999",
                                  "20,000-49,999",
                                  "50,000-99,999",
                                  "More than 100,000"))) %>% 
  mutate(hukou.status = factor(hukou.status,
                               levels=c(1:6),
                               labels=c("Urban with Urban Hukou",
                                        "Urban with Rural Hukou",
                                        "Rural with Rural Hukou",
                                        "Rural with Urban Hukou",
                                        "Overseas Chinese (including Hong Kong and Macao)",
                                        "Other"))) %>% 
  mutate(hukou.status.other = ifelse(hukou.status.other=="", NA, hukou.status.other))

  
# Make index variables
    
# Recode substantive variables  
privacy <- privacy %>%   
  mutate(across(c(k1, k4, k5, k6), ~factor(., levels=c(1, 2, 3, 4, 5, 6, 7), 
                                           labels=c("Strongly agree (1)",
                                                    "(2)",
                                                    "(3)",
                                                    "(4)",
                                                    "(5)",
                                                    "(6)",
                                                    "Strongly disagree (7)")))) %>% 
  mutate(k7 = factor(k7, 
                     levels=c(1, 2, 3, 4),
                     labels=c("Yes, heard the specific details of it",
                              "Yes heard general information about it but not specific details",
                              "Yes, heard the term but not any information about it",
                              "No, have not heard of it"))) 
  
 